Revit 2026 API

# ConicalSurface Methods

---

The ConicalSurface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a conical surface defined by a local reference frame and a half angle. |
|  | Dispose | (Inherited from Surface) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundingBoxUV | Gets the UV bounding box of the surface. (Inherited from Surface) |
|  | GetFrameOfReference | Returns frame of reference associated with this ConicalSurface. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidConeAngle | Checks whether the input value lies is not 0, greater than -PI/2 and lesser than PI/2. |
|  | Project | Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails. (Inherited from Surface) |
|  | ProjectWithGuessPoint | Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails. (Inherited from Surface) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ConicalSurface Class

Autodesk.Revit.DB Namespace